spec/data/has_total_zero_invoices.json

{
    "object":"list",
    "has_more":true,
    "url":"/v1/events",
    "data":[
        {
            "id":"evt_15FOhn2eZvKYlo2CdTvYQvKO",
            "created":1419940951,
            "livemode":false,
            "type":"invoice.payment_succeeded",
            "data":{
                "object":{
                    "date":1419937241,
                    "id":"in_15FNjx2eZvKYlo2Ct5RQ9GNR",
                    "period_start":1417345182,
                    "period_end":1419937182,
                    "lines":{
                        "object":"list",
                        "total_count":1,
                        "has_more":false,
                        "url":"/v1/invoices/in_15FNjx2eZvKYlo2Ct5RQ9GNR/lines",
                        "data":[
                            {
                                "id":"sub_3wp56UJDYHZk2P",
                                "object":"line_item",
                                "type":"subscription",
                                "livemode":false,
                                "amount": 150,
                                "currency":"usd",
                                "proration":false,
                                "period":{
                                    "start":1419937182,
                                    "end":1422615582
                                },
                                "subscription":null,
                                "quantity":1,
                                "plan":{
                                    "interval":"month",
                                    "name":"Amazing Free Plan",
                                    "created":1398851532,
                                    "amount":150,
                                    "currency":"usd",
                                    "id":"free",
                                    "object":"plan",
                                    "livemode":false,
                                    "interval_count":1,
                                    "trial_period_days":null,
                                    "metadata":{
                                    	"taxRate": 19
                                    },
                                    "statement_descriptor":null
                                },
                                "description":null,
                                "metadata":{

                                }
                            }
                        ]
                    },
                    "subtotal":150,
                    "total":150,
                    "customer":"1",
                    "object":"invoice",
                    "attempted":true,
                    "closed":true,
                    "forgiven":false,
                    "paid":true,
                    "livemode":false,
                    "attempt_count":0,
                    "amount_due":0,
                    "currency":"usd",
                    "starting_balance":0,
                    "ending_balance":0,
                    "next_payment_attempt":null,
                    "webhooks_delivered_at":1419937244,
                    "charge":null,
                    "discount":null,
                    "application_fee":null,
                    "subscription":"1",
                    "tax_percent":19,
                    "metadata":{

                    },
                    "statement_descriptor":null,
                    "description":null,
                    "receipt_number":null
                }
            },
            "object":"event",
            "pending_webhooks":0,
            "request":null,
            "api_version":"2014-12-22"
        },
        {
            "id":"evt_15FOaO2eZvKYlo2CAH6zaGM3",
            "created":1419940492,
            "livemode":false,
            "type":"invoice.payment_succeeded",
            "data":{
                "object":{
                    "date":1419936807,
                    "id":"in_15FNcx2eZvKYlo2CSlBGQnS9",
                    "period_start":1417344752,
                    "period_end":1419936752,
                    "lines":{
                        "object":"list",
                        "total_count":1,
                        "has_more":false,
                        "url":"/v1/invoices/in_15FNcx2eZvKYlo2CSlBGQnS9/lines",
                        "data":[
                            {
                                "id":"sub_3woyodz0tfu1VM",
                                "object":"line_item",
                                "type":"subscription",
                                "livemode":false,
                                "amount":0,
                                "currency":"usd",
                                "proration":false,
                                "period":{
                                    "start":1419936752,
                                    "end":1422615152
                                },
                                "subscription":"3",
                                "quantity":1,
                                "plan":{
                                    "interval":"month",
                                    "name":"Amazing Free Plan",
                                    "created":1398851532,
                                    "amount":0,
                                    "currency":"usd",
                                    "id":"free",
                                    "object":"plan",
                                    "livemode":false,
                                    "interval_count":1,
                                    "trial_period_days":null,
                                    "metadata":{
                                    	"taxRate": 45
                                    },
                                    "statement_descriptor":null
                                },
                                "description":null,
                                "metadata":{

                                }
                            }
                        ]
                    },
                    "subtotal":0,
                    "total":0,
                    "customer":"3",
                    "object":"invoice",
                    "attempted":true,
                    "closed":true,
                    "forgiven":false,
                    "paid":true,
                    "livemode":false,
                    "attempt_count":0,
                    "amount_due":0,
                    "currency":"usd",
                    "starting_balance":0,
                    "ending_balance":0,
                    "next_payment_attempt":null,
                    "webhooks_delivered_at":1419936814,
                    "charge":null,
                    "discount":null,
                    "application_fee":null,
                    "subscription":"3",
                    "tax_percent":29,
                    "metadata":{

                    },
                    "statement_descriptor":null,
                    "description":null,
                    "receipt_number":null
                }
            },
            "object":"event",
            "pending_webhooks":0,
            "request":null,
            "api_version":"2014-12-22"
        }
    ]
}